# ViewsExportedByContextEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewsExportedByContextEventArgs Class
Members See Also
---
The event arguments used by the ViewsExportedByContext event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public class ViewsExportedByContextEventArgs : RevitAPIPostDocEventArgs
```

Visual Basic
---
```text
Public Class ViewsExportedByContextEventArgs _
	Inherits RevitAPIPostDocEventArgs
```

Visual C++
---
```text
public ref class ViewsExportedByContextEventArgs : public RevitAPIPostDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostDocEventArgs Autodesk.Revit.DB.Events..::..ViewsExportedByContextEventArgs
# See Also
ViewsExportedByContextEventArgs Members
Autodesk.Revit.DB.Events Namespace